export const achiemeventCategories = [
  {
    label:
      "Наличие статуса чемпиона и призера Олимпийских игр, Паралимпийских игр и Сурдлимпийских игр, чемпиона мира, чемпиона Европы, победителя первенства мира, первенства Европы по видам спорта, включенным в программы Олимпийских игр, Паралимпийских игр и Сурдлимпийских игр",
    value: 1,
  },
  {
    label:
      "Наличие золотого значка, полученного за результаты сдачи норм физкультурного комплекса «Готов к труду и обороне» 2020-2021 годах",
    value: 2,
  },
  {
    label:
      "Наличие аттестата о среднем общем образовании с отличием или диплома СПО с отличием",
    value: 3,
  },
  {
    label: "Осуществление волонтерской (добровольческой) деятельности",
    value: 4,
  },
  {
    label:
      "Участие и (или) результаты участия в олимпиадах школьников (не используемые для получения особых прав и (или) особого преимущества при поступлении на обучение по конкретным условиям поступления)",
    value: 5,
  },

  {
    label:
      "Участие и (или) результаты участия в мероприятиях, включенных в перечень, утвержденный Минпросвещения России в соответствии с п. 4 Правил выявления детей, проявивших выдающиеся способности и сопровождения их дальнейшего развития, утвержденных постановлением Правительства РФ от 17 ноября 2015 г. No 1239",
    value: 6,
  },
  {
    label:
      "Победители и призеры физкультурных мероприятий и конкурсов военно-патриотической направленности 2017-2021 годов",
    value: 7,
  },
  {
    label:
      "Победители чемпионата по профессиональному мастерству среди инвалидов и лиц с ограниченными возможностями здоровья «Абилимпикс»",
    value: 8,
  },
  {
    label: "Итоговое сочинение выпускников 2021 года",
    value: 9,
  },
  {
    label: "Интеллектуальные или творческие мероприятия, организатором которых является ДГТУ (олимпиады, конкурсы, чемпионаты, форумы, конференции и т.д.)",
    value: 10,
  },
];
