import React, { useEffect } from "react";
import { cn } from "../../services/helpers/classname";
import { EducationProperties } from "../../components/EducationProperties";
import { EducationRelation } from "../../components/EducationRelation";
import { EducationSummary } from "../../components/EducationSummary";

import "./styles.scss";
import { useOvermind } from "../../store";
import { useRouteMatch } from "react-router-dom";

const block = cn("program-page");

export function ProgramPage() {
  const { state, actions } = useOvermind();

  const { params } = useRouteMatch();
  const programId = (params as any)["id"] as string;

  useEffect(() => {
    actions.programs.getProgram(programId);
  }, [actions.programs, programId]);

  const program = state.programs.currentProgram;

  return program ? (
    <div className={block()}>
      <EducationSummary
        title={program.title}
        type={EducationSummary.type.program}
        relations={
          <>
            <EducationRelation
              id="1"
              type={EducationSummary.type.specialty}
              code="01.03.04"
              name="Прикладная математика"
            />
            <EducationRelation
              id="1"
              type={EducationSummary.type.major}
              code="01.00.00"
              name="Математика и механика"
            />
          </>
        }
      />
      <EducationProperties
        list={[
          {
            name: "Форма обучения",
            value: program.attendance ? "очная" : "заочная",
          },
          { name: "Уровень образования", value: program.degree },
          { name: "Срок обучения", value: `${program.studyPeriod} года` },
          { name: "Языки обучения", value: program.languages },
        ]}
      />
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>Описание программы</span>
        <span className={block("text-block-content")} dangerouslySetInnerHTML={{__html: program.description}}/>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>
          Преимущества программы
        </span>
        <span className={block("text-block-content")}>
          Важной особенностью программы является сочетание изучения
          фундаментальных математических и естественно˗научных дисциплин с
          овладением умениями и навыками применения математических методов,
          наукоемкого программного обеспечения и современных технологий
          программирования для решения прикладных задач. Программа нацелена на
          решение важной задачи ˗ формирование способности применять полученные
          знания для решения конкретных задач, что в настоящее время актуально
          на рынке труда. Содержание преподаваемых дисциплин, тематика дипломных
          работ и научно˗исследовательской работы обучающихся неразрывно связаны
          с решением актуальных практических задач. Изучение целого ряды
          дисциплин, таких как Математические модели в науке, технике и
          экономике, Оптимизационное задачи в технических и экономических
          приложениях, Системный анализ и теория принятия решений, Основы
          проектной деятельности, Модельно˗ориентированное проектирование,
          Технологии научных исследований, Лучшие зарубежные практики и др.
          подкрепляется практиками, среди которых важное место занимают
          научно˗исследовательская работа и проектно˗технологиченская практика.{" "}
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>Организации-партнеры</span>
        <span className={block("text-block-content")}>
          — Научно-исследовательский институт механики и прикладной математика
          им. И.И. Воровича, Южный федеральный университет; — Акционерное
          общество Всероссийский научно˗исследователький институт «Градиент»; —
          Федеральное государственное унитарное предприятие «ростовский-на-дону
          научно-исследовательский институт радиосвязи».
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>Проекты и практики</span>
        <span className={block("text-block-content")}>
          Важными приоритетами программы являются разработка математических
          моделей процессов и систем, математическое обеспечение проектной
          деятельности и разработка проектов. Перечислим некоторые из проектов,
          подготовленные обучающимися: проектирование системы комфортного дома,
          проектирование синергетического управления для системы «Валовой
          продукт – трудовые ресурсы», проектирование экспертной системы для
          оценки качества знаний. Изучение практических приложений
          математических методов проводится, как в рамках освоения
          соответствующих дисциплин, так и в ходе практик. Типы учебных практик:
          ознакомительная и научно исследовательская работа, реализуются во 2˗м
          и 4˗м семестрах обучения соответственно. Типы производственной
          практики: проектно˗технологическая и научно˗исследовательская работа
          (6 семестр) и преддипломная практика (8 семестр). Для проведения
          проектно˗технологической практики выбираются предприятия и учреждения,
          в которых обучающиеся приобретают опыт практического применения
          математических методов и моделей при решении исследовательских и
          проектных задач в конкретных областях. Среди баз практик, например,
          Акционерное общество Всероссийский научно˗исследователький институт
          «Градиент», Федеральное государственное унитарное предприятие
          «ростовский-на-дону научно-исследовательский институт радиосвязи».
          Научно˗исследовательская работа ведется под руководством ведущих
          преподавателей кафедры, начиная со второго года обучения, и
          предполагает подготовку научных публикаций, участие в работе
          конференций и выставок, участие в конкурсах научных работ. Одно из
          актуальных направлений исследований ˗ это модели механики контакта и
          разрушения, рассматриваются контактные и смешанные задачи теории
          упругости для объектов, моделирующих реальные сооружения, конструкции,
          детали. Спектр направлений научной деятельности достаточно широк,
          помимо упомянутых выше задач, исследования охватывают следующие
          области ˗ теория управления динамическими системами, интеллектуальные
          системы, математическое моделирование и оптимизационные задачи в
          научной, производственной, экономической, социальной, управленческой
          сферах, а также в области медицины, здоровьесбережения, безопасности
          жизнедеятельности, экологии, техники, образования.{" "}
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>
          Преподаватели-флагманы
        </span>
        <span className={block("text-block-content")}>
          Научный руководитель программы заведующий кафедрой Прикладная
          математика ДГТУ, доктор физико˗математических наук, профессор
          Пожарский Дмитрий Александрович
          (https://donstu.ru/structure/cadre/pozhars
          kiy-dmitriy-aleksandrovich), имеет 10˗летний опыт профессиональной
          деятельности по направлению программы, за это время руководил
          подготовкой 15 выпускных квалификационных работ бакалавров.
          Научно˗педагогическую деятельность по данному направлению осуществляет
          в течение 30 лет. Одной из основных черт профессиональной деятельности
          Пожарского Д.А. по реализации данной программы является неразрывная
          связь преподаваемых дисциплин, тематики дипломных работ и
          научно˗исследовательской работы обучающихся с решением актуальных
          прикладных задач механики контакта и разрушения. В данной области
          Пожарский Д.А. является признанным в мире специалистом, большое
          количество его работ опубликованы в известных журналах, индексируемых
          в Scopus и WoS, ведет активную деятельность по выполнению научных
          грантов, в настоящее время является руководителем двух грантов РФФИ
          «Контактные и смешанные задачи теории упругости для неоднородных
          цилиндрических, клиновидных и слоистых тел», «Периодические контактные
          и смешанные задачи теории упругости». Профессор кафедры Прикладная
          математика, доктор физико˗математических наук, профессор Братищев
          Александр Васильевич
          (https://donstu.ru/structure/cadre/bratishchev-aleksandr-vasilevich),
          имеет 10˗летний опыт профессиональной деятельности по направлению
          программы, а научно˗педагогическую деятельность по данному направлению
          осуществляет в течение 25 лет, награжден знаком «Почетный работник
          высшего профессионального образования Российской Федерации». В
          реализации данной программы преподает дисциплины Стандартные пакеты
          прикладной математики, Анализ временных рядов, Математические методы
          анализа и синтеза систем, Модельно˗ориентированное проектирование,
          направленных на освоение наукоемких прикладных программ и их
          использования в моделировании и проектировании. Руководит выполнением
          выпускных квалификационных работ и научно˗исследовательской работой
          бакалавров, одно из актуальных направлений этой работы ˗
          синергетическое управление динамическими системами. Доцент кафедры
          Прикладная математика, кандидат физико˗математических наук, доцент
          Рябых Галина Юрьевна
          (https://donstu.ru/structure/cadre/ryabykh-galina-yurevna), имеет
          10˗летний опыт профессиональной деятельности по направлению программы,
          а научно˗педагогическую деятельность по данному направлению
          осуществляет в течение 35 лет, награждена знаком «Почетный работник
          высшего профессионального образования Российской Федерации». В
          реализации данной программы преподает дисциплины, обеспечивающие
          фундаментальную подготовку бакалавров ˗ Математический анализ, Теория
          функций комплексного переменного, Теория вероятностей и математическая
          статистика. Руководит выполнением выпускных квалификационных работ и
          научно˗исследовательской работой бакалавров с широкой научной
          тематикой в области экстремальных задач в пространствах аналитических
          функций и моделирования в экологии, медицине, здравоохранении.
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>
          Известные выпускники программы{" "}
        </span>
        <span className={block("text-block-content")}>
          Харахашьян Артем Михайлович ˗ кандидат технических наук, научный
          сотрудник Лаборатории космических исследований НИИ физики ЮФУ,
          является исполнителем гранта РФФИ «Космическая погода и характеристики
          распространения радиоволн в нижней и верхней ионосфере: получение и
          обработка экспериментальных данных, интерпретация, моделирование».
          Гукасян Лусинэ Суреновна ˗ старший преподаватель кафедры Прикладная
          математика ДГТУ, заместитель декана факультета Информатика и
          вычислительная техника ДГТУ.
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>
          Структурное подразделение
        </span>
        <span className={block("text-block-content")}>
          Кафедра Прикладная математика ДГТУ
        </span>
      </div>
      <div className={block("text-block")}>
        <span className={block("text-block-title")}>
          Руководитель программы
        </span>
        <span className={block("text-block-content")}>
          Заведующий кафедрой Прикладная математика ДГТУ, доктор
          физико˗математических наук, профессор Пожарский Д.А.{" "}
        </span>
      </div>
    </div>
  ) : null;
}
